<template>
    <div>
        <div class="text-h3 q-ma-md" style="font-family: AppleMyungjo; ">
            <div align="left"><span class="text-cyan">Reading</span><span
                    class="text-accent">Area</span></div>
        </div>
        <q-separator dark></q-separator>
        <q-editor v-model="editor" min-height="5rem" align="left" :toolbar="[
        [
          {
            label: $q.lang.editor.align,
            icon: $q.iconSet.editor.align,
            fixedLabel: true,
            options: ['left', 'center', 'right', 'justify']
          }
        ],
        ['bold', 'italic', 'strike', 'underline', 'subscript', 'superscript'],
        ['token', 'hr', 'link', 'custom_btn'],
        ['print', 'fullscreen'],
        [
          {
            label: $q.lang.editor.formatting,
            icon: $q.iconSet.editor.formatting,
            list: 'no-icons',
            options: [
              'p',
              'h1',
              'h2',
              'h3',
              'h4',
              'h5',
              'h6',
              'code'
            ]
          },
          {
            label: $q.lang.editor.fontSize,
            icon: $q.iconSet.editor.fontSize,
            fixedLabel: true,
            fixedIcon: true,
            list: 'no-icons',
            options: [
              'size-1',
              'size-2',
              'size-3',
              'size-4',
              'size-5',
              'size-6',
              'size-7'
            ]
          },
          {
            label: $q.lang.editor.defaultFont,
            icon: $q.iconSet.editor.font,
            fixedIcon: true,
            list: 'no-icons',
            options: [
              'default_font',
              'arial',
              'arial_black',
              'comic_sans',
              'courier_new',
              'impact',
              'lucida_grande',
              'times_new_roman',
              'verdana'
            ]
          },
          'removeFormat'
        ],
        ['quote', 'unordered', 'ordered', 'outdent', 'indent'],
        ['undo', 'redo']
      ]" :fonts="{
        arial: 'Arial',
        arial_black: 'Arial Black',
        comic_sans: 'Comic Sans MS',
        courier_new: 'Courier New',
        impact: 'Impact',
        lucida_grande: 'Lucida Grande',
        times_new_roman: 'Times New Roman',
        verdana: 'Verdana'
      }"/>
    </div>
</template>

<script>
    export default {
        name: "readArea",
        props:{
            fileSelected:String
        },
        computed: {
            editor: function () {
                //var content = this.$api.files.getFileContent(this.fileSelected)
                var content = 'This is Test2文章\n' +
                    '\n' +
                    '上海财经大学信息管理与工程学院学生联合会\n' +
                    '外联部\n' +
                    '2020年2月\n' +
                    '一、活动背景\n' +
                    '信息学院举办活动存在迎宾人员欠缺、不固定、不专业等问题，需要一支经过训练的礼仪团队来一应满足所办活动的要求。此外，步入大学，学院女生普遍有对外在提升的内在需求，希望能得到专业的指导与实践的机会和平台。\n' +
                    '二、活动宗旨与意义\n' +
                    '信息学院举办团学联活动维持秩序与迎宾，可以让同学们在活动中更有参与感的同时，保证人手充足与现场秩序，用专业的训练成果为到场嘉宾带来更好的体验，提高活动的质量。此外，学院女生在经过专业培训与亲身实践后，能提升气质，塑造自身完美形象，不仅能满足对外在提升的内在需求，提高沟通与应对能力，智慧才华与表现气质并重，丰富课余生活，也能提升学院整体学生形象与素养。该活动可以为喜爱礼宾工作的同学提供展现自己的舞台，发掘和培养具有利益天赋和潜力、综合素质突出的优秀学生。同时，在人才招聘会上，言谈儒雅、服饰得体、仪表端庄、神态大方、礼仪到位的大学生更能受到用人单位的青睐。礼仪队的训练可以积累学院女生就业求职礼仪经验，让她们在就业竞争日趋激烈的背景之下脱颖而出。本次活动希望通过以上各个方面，从而提升学院综合素质。\n' +
                    '三、活动介绍\n' +
                    '活动总时间：预计十四周\n' +
                    '活动总人数：礼仪队现在共九人，其余人员还有每次外联的工作人员及每次的讲师，约15人/次\n' +
                    '四、培训流程\n' +
                    '主题\n' +
                    '内容\n' +
                    '意义\n' +
                    '形式\n' +
                    '时间及地点\n' +
                    '讲师\n' +
                    '化妆\n' +
                    '基础讲解\n' +
                    '&日常妆\n' +
                    '介绍化妆品及基本的化妆技巧\n' +
                    '技巧可以考虑针对性强一点的教学，或许可以考虑发个问卷调查礼仪队成员更希望去学习修饰自己的哪个部位\n' +
                    '线下教学+线上网课\n' +
                    '第一周\n' +
                    '地点信院或者大活都可以\n' +
                    '可以请对化妆了解比较多的姐姐，\n' +
                    '或着身边比较熟的妆娘\n' +
                    '化妆\n' +
                    '主持人妆\n' +
                    '干练庄重\n' +
                    '适合颁奖\n' +
                    '线上网课\n' +
                    '最好要收作业，并能及时反馈\n' +
                    '第二周发放\n' +
                    '\n' +
                    '化妆\n' +
                    '职业妆\n' +
                    '庄重大方\n' +
                    '适合迎宾\n' +
                    '同上\n' +
                    '第三周发放\n' +
                    '\n' +
                    '化妆\n' +
                    '舞会妆\n' +
                    '明快生动\n' +
                    '舞会控场\n' +
                    '同上\n' +
                    '第四周发放\n' +
                    '\n' +
                    '化妆\n' +
                    '总结\n' +
                    '整体收获\n' +
                    '经验交流\n' +
                    '答疑\n' +
                    '线下\n' +
                    '第五周\n' +
                    '同上\n' +
                    '形体\n' +
                    '形体训练\n' +
                    '主要提升内在气质\n' +
                    '有条件线下教学，没有也可以网课，但是考虑到自己坚持比较难，必须线下集中学习练习，并及时反馈\n' +
                    '形体房\n' +
                    '第七周\n' +
                    '第九周\n' +
                    '第十一周\n' +
                    '第十二周\n' +
                    '第十三周\n' +
                    '第十四周\n' +
                    '暂定六次\n' +
                    '\n' +
                    '暂定\n' +
                    '如果是线下，最好六次的老师是同一位，这样不容易乱\n' +
                    '时间可再安排\n' +
                    '礼仪\n' +
                    '坐姿，蹲姿，行姿，站姿\n' +
                    '迎宾颁奖必需的教学\n' +
                    '线下教学\n' +
                    '大活（比较空旷的地方）\n' +
                    '第六周\n' +
                    '前礼仪队成员\n' +
                    '礼仪\n' +
                    '再复习一次上一次礼仪课内容\n' +
                    '微笑等其他注意事项\n' +
                    '迎宾颁奖必需的教学\n' +
                    '线下教学\n' +
                    '大活（比较空旷的地方）\n' +
                    '第八周\n' +
                    '前礼仪队成员\n' +
                    '穿搭\n' +
                    '工作服的穿法\n' +
                    '饰品的选择\n' +
                    '迎宾颁奖必需的教学\n' +
                    '线下教学\n' +
                    '信院\n' +
                    '第十周\n' +
                    '前礼仪队成员\n' +
                    '五、 人员安排\n' +
                    '一人负责联系讲师及确定到场人数（包括讲师），联系好的讲师需提前一周第一次确认，提前两天第二次确认。\n' +
                    '一人负责借用场地及安排物资。需要成员自身准备的物品提前两天通知一次，当天再提醒一次。\n' +
                    '一人负责每次制作问卷，收集成员反馈，完善培训流程。\n' +
                    '\n' +
                    '六、应用场景\n' +
                    '1.大型活动如:党章知识竞赛\\涂鸦活动\\运动赛\\舞会\\讲座\n' +
                    '礼仪队员若干(根据场馆大小需要,例如创新创业中心安排3人即可,门口一人迎接,走廊一人引导,舞台一人控场)\n' +
                    '礼仪队员主要作用是为现场群众分流,合理安排人流,避免混乱,所以应提前了解并熟悉场地分配;同时尽可能帮助活动人员答疑,简单知道活动内容\\活动形式\\活动目的,使得被吸引来的新朋友能迅速参与活动中,增加人气,使得对活动认识陌生的朋友能提起兴趣加入其中.次要作用是让整个活动表现得更加专业,在活动期间记录的照片中呈现出井井有条的场面,也留下礼仪队员优雅大方的姿态,给参与活动的同学老师以及审查活动的领导人员带来良好的氛围,留下好印象.\n' +
                    '2.典礼仪式如:荣休仪式,颁奖\n' +
                    '至少两名礼仪队员轮换交替上台颁奖,由台下志愿者或者第三位礼仪队员按照颁奖广播把奖状奖牌等交接给需要上台的礼仪队员\n' +
                    '礼仪队员主要作用是使得颁奖或仪式过程流畅有序的进行,必要的时候需要有一定的场控能力,控制颁奖进度. 次要作用是让整个颁奖过程表现得更加隆重和专业,在活动期间记录的照片中留下礼仪队员优雅大方的姿态,展示队员身上优质的大学生风采,为现场人员提供更好的服务.\n' +
                    '七、活动展望\n' +
                    '对于面向全校的宣传，可以在绿叶门口摆放门型展架，发放单页宣传页或印有礼仪队宣传消息的小礼物，如扇子、书签、纸巾等\n' +
                    '制作公众号推送让全校师生更加了解信息礼仪队\n' +
                    '具体落实将宣传信息发放到年级群、各学院群中\n' +
                    '八、物资准备\n' +
                    '1.礼仪队员自身\n' +
                    '服装(红\\白旗袍,白色衬衫,黑色西装),高跟鞋(5~7cm黑或白色无装饰),领结,合适的发饰,化妆品(底妆\\眼妆\\唇妆,化妆或补妆时使用)\n' +
                    '2.附加品\n' +
                    '需由礼仪队员送出的活动小礼品,仪式现场的花束,颁奖现场的托盘\n' +
                    '3.备用品(为避免突发状况准备)\n' +
                    '创口贴(防止高跟鞋不合适),胶带\\小夹子(防止服装不合适),黑色发卡(处理碎发),发绳(防止头发散落),备用服装(防服装弄脏破坏)\n' +
                    '4. 培训所需物资\n' +
                    '化妆课需要镜子、化妆品试用装\n' +
                    '形体课需要形体服、形体鞋\n' +
                    '穿搭课需要准备队服\n' +
                    '九、 应急措施\n' +
                    '1. 提前沟通内训时间。如讲师突发急事不能参加内训，时间足够联系别的合适讲师，不够可以考虑内训顺延；如成员突发急事不能参加内训，可以让该队员私下询问其余队员，同时外联工作人员与讲师沟通，复习总结的课或许可以稍微详细一点。\n' +
                    '2. 礼仪队参加活动时，备好备用品（如上八.物资准备中的第三条）。提前决定备用成员，防止有突发意外导致某位成员不能参加活动。\n' +
                    '\n';
                return content.replace(/(\r)*\n/g, "<br/>").replace(/\s/g, " ");
            }
        },
        data() {
            return {
                //editor: 'What you see is <b>what   sadfsaf   \n     you get.'
            }
        }
    }
</script>

<style lang="css" scoped>

</style>